ir_template = """*Имя*, например: KHAED WADGE
*Адрес, 1 строка*, например: 2708123 Israel
*Адрес, 2 строка*, например: Hod Hasharon
*Адрес, 3 строка*, например: 5 Eln Hal
*Statement date*, например: Sep 22 2025
*Previouse balance date*, например: Aug 4
*Payment*, например: Aug 5
*Actual reading, 1 строка*, например: Sep 22, 2025
*Actual reading, 2 строка*, например: Aug 22, 2025
*1 блок данных с числами справа.*, например: 182.55
*2 блок данных. Supplier.*, например: 131.76
*2 блок данных. Delivery.*, например: 79.63
*2 и 3 блок данных. Total.*, например: 125.39 или 116.39
*3 блок. The total ... by*, например Oct 22
*3 блок. Год на след строке*, например 2025
*3 блок. Billing period*, например: Aug 22- Sep 22 (30 days)
*3 блок снизу справа. 1 значение*, например: 23412
*3 блок снизу справа. 2 значение*, например: 12341
*4 блок сверху справа. Actual usage*, например: 1321
*5 блок. Total*, например: 189.76
*Блок слева. 1 строка*, например: Aug 2025 (37F)
*Блок слева. 2 строка*, например: Aug 2024 (37F)
*Киловаты. 1 строка*, например: 33
*Киловаты. 2 строка*, например: 33"""

gb_template = """*Имя*, например: Whilkhu Pardeep
*Адрес, 1 строка*, например: 20 Henley Road
*Адрес, 2 строка*, например: Boverton
*Адрес, 3 строка*, например: CF61 3RL
*Statement date*, например: 17 Sep 2025
*Statement period*, например: 16 Aug 2025 - 16 Sep 2025
*Customer number*, например: 83 14 44 56 14
*Balance*, например: £889.05
*2 блок(What ... pay)*, например: 356.73
*3 блок(tariff is)*, например: £1478.37
*What you've paid*, например: -£254.48
*Your ... debit by*, например: £313.59"""

ie_template = """*Имя*, например: John Citizen
*Адрес, 1 строка*, например: kiltippper way Tallaght
*Адрес, 2 строка*, например: 53 Marlfield place
*Адрес, 3 строка*, например: DUBLIN 24
*Адрес, 4 строка*, например: D24F3P9
*Дата под адресом*, например: 09 July 2025
*Дата под Gas usage*, например: 02 May 2025 to 06 Jul 2025
*Supply Address*, например: 53 Marlfield Place, Tallaght, Dublin 24
*Синие киловаты*, например: 9,261 kWh
*Голубые киловаты*, например: 8,089 kWh
*Бирюзовые киловаты*, например: 11,000 kWh
*Account number*, например: 4973046944
*Contract end date*, например: 18 March 2025
*Total due*, например: 60.64
*Due on*, например: 23 July 2025
*Блок "Gas". Строка Gas ... Discount(1 стр.)*, например: 19 Mar 2025 to 18
*Блок "Gas". Строка ниже предыдущей(продолжение)*, например: Mar 2025.
*"Gas". Значение Standing Charge*, например: 21.85
*"Gas". Значение Unit Rate*, например: 35.98
*"Gas". Значение Carbon Tax*, например: 3.56
*"Gas". Значение Gas Affinity Discount*, например: 5.76
*"Gas". Значение VAT*, например: 5.01
*"Gas". Значение Previous bill*, например: 190.32"""